#+TITLE:Work Agenda
#+TODO: TODO(t) WAIT(w@/!) | CANCELLED(c@) DONE(d)

* Recurring Meetings

** TODO Standup Mon
   SCHEDULED: <2020-02-10 Mon 11:00 ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-02-04 Tue 07:31]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-01-27 Mon 10:59]--[2020-01-27 Mon 11:17] =>  0:18
   CLOCK: [2020-02-03 Mon 10:59]--[2020-02-03 Mon 11:25] =>  0:26
   :END:

** TODO Standup Tue
   SCHEDULED: <2020-02-11 Tue 11:00 ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-02-04 Tue 10:58]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-02-04 Tue 10:58]--[2020-02-04 Tue 11:16] =>  0:18
   CLOCK: [2020-01-28 Tue 10:57]--[2020-01-28 Tue 11:22] =>  0:25
   :END:

** TODO Standup Wed
   SCHEDULED: <2020-02-12 Wed 11:00 ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-02-05 Wed 10:52]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-02-05 Wed 10:55]--[2020-02-05 Wed 11:23] =>  0:28
   CLOCK: [2020-01-29 Wed 11:00]--[2020-01-29 Wed 11:23] =>  0:23
   :END:

** TODO Standup Thu
   SCHEDULED: <2020-02-13 Thu 11:00 ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-02-07 Fri 12:54]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-01-30 Thu 11:00]--[2020-01-30 Thu 11:15] =>  0:15
   :END:

** TODO Standup Fri
   SCHEDULED: <2020-02-14 Fri 11:00 ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-02-07 Fri 12:54]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-01-31 Fri 11:00]--[2020-01-31 Fri 11:20] =>  0:20
   CLOCK: [2020-02-07 Fri 11:00]--[2020-02-07 Fri 11:15] =>  0:15
   :END:


** TODO Analysts meeting
   SCHEDULED: <2020-02-17 Mon ++2w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-02-04 Tue 07:33]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-02-03 Mon 12:30]--[2020-02-03 Mon 13:45] =>  1:15
   :END:


* 2019 - NOV

** Week 1
   :LOGBOOK:
   CLOCK: [2019-11-08 Fri 06:40]--[2019-11-08 Wed 14:06] =>  7:26
   CLOCK: [2019-11-07 Thu 07:30]--[2019-11-07 Wed 15:14] =>  7:44
   CLOCK: [2019-11-06 Wed 07:29]--[2019-11-06 Wed 15:45] =>  8:16
   CLOCK: [2019-11-05 Tue 13:47]--[2019-11-05 Tue 16:47] =>  3:00
   CLOCK: [2019-11-05 Tue 07:20]--[2019-11-05 Tue 12:54] =>  5:34
   CLOCK: [2019-11-04 Mon 12:00]--[2019-11-04 Mon 16:30] =>  4:30
   CLOCK: [2019-11-04 Mon 08:30]--[2019-11-04 Mon 11:00] =>  2:30
   :END:

*** TODO Mark Meeting Mon
    :PROPERTIES:
    :LAST_REPEAT: [2019-11-12 Tue 08:54]
    :END:
    - State "DONE"       from "TODO"       [2019-11-12 Tue 08:54]
    - State "DONE"       from "TODO"       [2019-11-11 Mon 14:25]
*** TODO Mark Meeting Tue
    :PROPERTIES:
    :LAST_REPEAT: [2019-11-12 Tue 09:45]
    :END:
    - State "DONE"       from "TODO"       [2019-11-12 Tue 09:45]
*** TODO Mark Meeting Wed
    :PROPERTIES:
    :LAST_REPEAT: [2019-11-13 Wed 10:46]
    :END:
    - State "DONE"       from "TODO"       [2019-11-13 Wed 10:46]
    - State "DONE"       from "TODO"       [2019-11-06 Wed 09:56]
*** TODO Mark Meeting Thu
    :PROPERTIES:
    :LAST_REPEAT: [2019-11-14 Thu 10:54]
    :END:
    - State "DONE"       from "TODO"       [2019-11-14 Thu 10:54]
    - State "DONE"       from "TODO"       [2019-11-07 Thu 12:24]
*** TODO Mark Meeting Fri
    :PROPERTIES:
    :LAST_REPEAT: [2019-11-15 Fri 13:39]
    :END:


    - State "DONE"       from "TODO"       [2019-11-15 Fri 13:39]
    - State "DONE"       from "TODO"       [2019-11-08 Fri 13:11]


*** DONE Code Meeting
    SCHEDULED: <2019-11-06 Wed 13:30>
    - State "DONE"       from "TODO"       [2019-11-06 Wed 14:33]


*** DONE database meeting
    SCHEDULED: <2019-11-07 Thu 14:00>
    - State "DONE"       from "TODO"       [2019-11-07 Thu 14:01]


** Week 2
   :LOGBOOK:
   CLOCK: [2019-11-15 Fri 06:15]--[2019-11-15 Fri 14:15] =>  8:00
   CLOCK: [2019-11-14 Thu 06:15]--[2019-11-14 Wed 13:15] =>  7:00
   CLOCK: [2019-11-13 Wed 06:30]--[2019-11-13 Wed 15:00] =>  8:30
   CLOCK: [2019-11-12 Tue 06:30]--[2019-11-12 Tue 14:45] =>  8:15
   CLOCK: [2019-11-11 Mon 06:15]--[2019-11-11 Mon 14:30] =>  8:15
   :END:

*** DONE analysts lunch meeting
    SCHEDULED: <2019-11-13 Wed 13:00>
    - State "DONE"       from "TODO"       [2019-11-14 Thu 06:10]

** Week 3
   :LOGBOOK:
   CLOCK: [2019-11-22 Fri 06:30]--[2019-11-22 Thu 14:30] =>  8:00
   CLOCK: [2019-11-21 Thu 06:15]--[2019-11-21 Thu 14:15] =>  8:00
   CLOCK: [2019-11-20 Wed 06:15]--[2019-11-20 Wed 14:15] =>  8:00
   CLOCK: [2019-11-19 Tue 06:00]--[2019-11-19 Tue 14:00] =>  8:00
   CLOCK: [2019-11-18 Mon 06:30]--[2019-11-18 Mon 14:30] =>  8:00
   :END:

*** DONE analyst lunch
    SCHEDULED: <2019-11-18 Mon 13:00>

*** DONE IBC app development
    SCHEDULED: <2019-11-22 Fri 13:00-14:00>

*** DONE demonstrate merge request
    SCHEDULED: <2019-11-22 Fri 11:30>

** Week 4
   :LOGBOOK:
   CLOCK: [2019-11-27 Wed 06:00]--[2019-11-27 Wed 14:00] =>  8:00
   CLOCK: [2019-11-26 Tue 06:15]--[2019-11-26 Tue 14:15] =>  8:00
   CLOCK: [2019-11-25 Mon 06:30]--[2019-11-25 Mon 14:30] =>  8:00
   :END:


* 2019 - DEC

*** DONE ibc app meetings

** Week 1
   :LOGBOOK:
   CLOCK: [2019-12-06 Fri 06:30]--[2019-12-06 Fri 14:30] =>  8:00
   CLOCK: [2019-12-05 Thu 06:15]--[2019-12-05 Thu 14:15] =>  8:00
   CLOCK: [2019-12-04 Wed 06:30]--[2019-12-04 Wed 14:00] =>  7:30
   CLOCK: [2019-12-03 Tue 06:30]--[2019-12-03 Tue 14:30] =>  8:00
   CLOCK: [2019-12-02 Mon 06:30]--[2019-12-02 Mon 15:00] =>  8:30
   :END:

*** DONE IBC app development follow up
    SCHEDULED: <2019-12-03 Tue 13:00>

*** DONE resource allocation project assignments
    SCHEDULED: <2019-12-03 11:30 Tue>

*** DONE meet with mark
    SCHEDULED: <2019-12-04 Wed>

*** DONE Team Meeting
    SCHEDULED: <2019-12-05 11:00 Thu>


** Week 2
   :LOGBOOK:
   CLOCK: [2019-12-13 Fri 06:00]--[2019-12-13 Fri 14:00] =>  8:00
   CLOCK: [2019-12-12 Thu 06:30]--[2019-12-12 Wed 14:30] =>  8:00
   CLOCK: [2019-12-11 Wed 06:30]--[2019-12-11 Wed 14:45] =>  8:15
   CLOCK: [2019-12-10 Tue 06:15]--[2019-12-10 Tue 13:30] =>  7:15
   CLOCK: [2019-12-09 Mon 06:15]--[2019-12-09 Mon 14:45] =>  8:30
   :END:

*** DONE Company Dinner
    SCHEDULED: <2019-12-10 Tue 11:45>

    Place: Glenhardie Country Club

*** DONE 5th Annual Company Dinner
    SCHEDULED: <2019-12-12 Thu 16:00>


** Week 3
   :LOGBOOK:
   CLOCK: [2019-12-20 Fri 06:15]--[2019-12-20 Fri 15:00] =>  8:45
   CLOCK: [2019-12-19 Thu 07:30]--[2019-12-19 Thu 15:15] =>  7:45
   CLOCK: [2019-12-18 Tue 06:30]--[2019-12-18 Tue 14:30] =>  8:00
   CLOCK: [2019-12-17 Tue 06:00]--[2019-12-17 Tue 14:00] =>  8:00
   CLOCK: [2019-12-16 Mon 06:45]--[2019-12-16 Mon 14:15] =>  7:30
   :END:

*** DONE Analysts meeting and lunch
    SCHEDULED: <2019-12-16 Mon 12:00>


** Week 4
   :LOGBOOK:
   CLOCK: [2019-12-23 Mon 06:00]--[2019-12-23 Mon 15:00] =>  9:00
   :END:


* 2020 - Jan

** Week 1
   :LOGBOOK:
   CLOCK: [2020-01-03 Fri 07:00]--[2020-01-03 Fri 15:00] =>  8:00
   :END:


** Week 2
   :LOGBOOK:
   CLOCK: [2020-01-10 Fri 06:45]--[2020-01-10 Fri 15:45] =>  9:00
   CLOCK: [2020-01-09 Thu 07:00]--[2020-01-09 Thu 14:00] =>  7:00
   CLOCK: [2020-01-08 Wed 06:15]--[2020-01-08 Thu 14:15] =>  8:00
   CLOCK: [2020-01-07 Tue 07:00]--[2020-01-07 Wed 15:00] =>  8:00
   CLOCK: [2020-01-06 Mon 07:00]--[2020-01-06 Mon 15:00] =>  8:00
   :END:


** Week 3
   :LOGBOOK:
   CLOCK: [2020-01-17 Fri 06:00]--[2020-01-17 Fri 14:00] =>  8:00
   CLOCK: [2020-01-16 Thu 06:15]--[2020-01-16 Thu 14:15] =>  8:00
   CLOCK: [2020-01-15 Wed 06:00]--[2020-01-15 Wed 14:00] =>  8:00
   CLOCK: [2020-01-14 Tue 06:30]--[2020-01-14 Tue 14:30] =>  8:00
   CLOCK: [2020-01-13 Mon 06:30]--[2020-01-13 Mon 14:30] =>  8:00
   :END:


** Week 4
   :LOGBOOK:
   CLOCK: [2020-01-24 Fri 06:15]--[2020-01-24 Fri 14:30] =>  8:15
   CLOCK: [2020-01-23 Thu 06:30]--[2020-01-23 Thu 14:00] =>  7:30
   CLOCK: [2020-01-22 Wed 06:15]--[2020-01-22 Wed 14:00] =>  7:45
   CLOCK: [2020-01-21 Tue 06:00]--[2020-01-21 Tue 14:00] =>  8:00
   CLOCK: [2020-01-20 Mon 06:45]--[2020-01-20 Mon 15:15] =>  8:30
   :END:

*** DONE roadmap meeting
    SCHEDULED: <2020-01-23 Thu 09:30>


** Week 5

#+BEGIN: clocktable :block thisweek :maxlevel 3
#+CAPTION: Clock summary at [2020-01-31 Fri 13:28], for week 2020-W05.
| Headline                          |       Time |          |         |
|-----------------------------------+------------+----------+---------|
| *Total time*                      | *1d 16:00* |          |         |
|-----------------------------------+------------+----------+---------|
| Standup Mon                       |       0:18 |          |         |
| Standup Tue                       |       0:25 |          |         |
| Standup Wed                       |       0:23 |          |         |
| Standup Thu                       |       0:15 |          |         |
| Standup Fri                       |       0:20 |          |         |
| 2020 - Jan                        |   1d 14:19 |          |         |
| \_  Week 5                        |            | 1d 14:19 |         |
| \_    cypress analytics tests     |            |          | 1d 9:09 |
| \_    export excel from amazon S3 |            |          |    5:10 |
#+END:

*** TODO cypress analytics tests
    :LOGBOOK:
    CLOCK: [2020-01-31 Fri 11:20]--[2020-01-31 Fri 14:30] =>  3:10
    CLOCK: [2020-01-31 Fri 08:25]--[2020-01-31 Fri 11:00] =>  2:35
    CLOCK: [2020-01-30 Thu 06:30]--[2020-01-30 Thu 11:00] =>  5:12
    CLOCK: [2020-01-29 Wed 11:23]--[2020-01-29 Wed 14:30] =>  3:07
    CLOCK: [2020-01-29 Wed 06:30]--[2020-01-29 Wed 11:00] =>  4:30
    CLOCK: [2020-01-28 Tue 11:22]--[2020-01-28 Tue 14:45] =>  3:23
    CLOCK: [2020-01-28 Tue 06:45]--[2020-01-28 Tue 10:57] =>  4:12
    CLOCK: [2020-01-27 Mon 11:17]--[2020-01-27 Mon 14:15] =>  2:58
    CLOCK: [2020-01-27 Mon 06:15]--[2020-01-27 Mon 10:59] =>  4:44
    :END:

*** DONE export excel from amazon S3
    :LOGBOOK:
    CLOCK: [2020-01-31 Fri 06:30]--[2020-01-31 Fri 08:25] =>  1:55
    CLOCK: [2020-01-30 Thu 11:15]--[2020-01-30 Thu 14:30] =>  3:15
    :END:


* 2020 - Feb

** Week 1

   #+BEGIN: clocktable :block thisweek :step day :maxlevel 3
   #+END:

*** DONE revise cost of care analytic
    :LOGBOOK:
    CLOCK: [2020-02-03 Mon 06:30]--[2020-02-03 Mon 08:30] =>  2:30
    :END:
*** DONE investigate failed cohort
    :LOGBOOK:
    CLOCK: [2020-02-04 Tue 11:31]--[2020-02-04 Tue 14:00] =>  2:29
    CLOCK: [2020-02-03 Mon 08:30]--[2020-02-03 Mon 09:30] =>  1:00
    CLOCK: [2020-02-05 Wed 08:56]--[2020-02-05 Wed 09:20] =>  0:24
    :END:
*** DONE ivestigate cypress max listeners exceeded
    :LOGBOOK:
    CLOCK: [2020-02-05 Wed 06:00]--[2020-02-05 Wed 07:14] =>  1:14
    CLOCK: [2020-02-04 Tue 06:30]--[2020-02-04 Tue 07:30] =>  1:30
    CLOCK: [2020-02-03 Mon 09:30]--[2020-02-03 Mon 11:00] =>  1:30
    CLOCK: [2020-02-03 Mon 11:25]--[2020-02-03 Mon 12:30] =>  1:05
    CLOCK: [2020-02-03 Mon 13:45]--[2020-02-03 Mon 14:00] =>  0:15
    :END:
*** TODO failing cypress tests
    :LOGBOOK:
    CLOCK: [2020-02-07 Fri 11:15]--[2020-02-07 Fri 14:30] =>  3:15
    CLOCK: [2020-02-07 Fri 06:30]--[2020-02-07 Fri 11:00] =>  4:30
    CLOCK: [2020-02-05 Wed 14:00]--[2020-02-05 Wed 16:00] =>  2:00
    CLOCK: [2020-02-05 Wed 11:23]--[2020-02-05 Wed 12:30] =>  1:07
    CLOCK: [2020-02-05 Wed 07:14]--[2020-02-05 Wed 08:56] =>  1:42
    CLOCK: [2020-02-05 Wed 09:20]--[2020-02-05 Wed 10:55] =>  1:35
    CLOCK: [2020-02-04 Tue 11:16]--[2020-02-04 Tue 11:31] =>  0:15
    CLOCK: [2020-02-04 Tue 07:30]--[2020-02-04 Tue 10:57] =>  3:27
    :END:
    MI still failed after adding 1000 to spop
*** CANCELLED linux discussion
    SCHEDULED: <2020-02-06 Thu 10:30>

    - State "CANCELLED"  from "TODO"       [2020-02-07 Fri 07:02] \\
      was sick
*** Sick
    :LOGBOOK:
    CLOCK: [2020-02-06 Thu 06:00]--[2020-02-06 Thu 14:30] =>  8:30
    :END:
